{
  "PLUGIN_NAME": "Raspberry Pi EEPROM Configuratie",
  "BASIC_SETTINGS": "Basis instellingen",
  "CONFIRM_BASIC_SETTINGS": "Basis instellingen bevestigen",
  "BOOT_ORDER": "Opstartvolgorde",
  "BOOT_ORDER_DOC": "Bepaalt de volgorde waarin de Raspberry Pi probeert op te starten vanaf verschillende apparaten. Het systeem zal elk apparaat op volgorde proberen totdat een opstartbaar systeem wordt gevonden.",
  "PSU_MAX_CURRENT": "Voeding Max. Stroom (mA)",
  "PSU_MAX_CURRENT_DOC": "Maximale stroom die de voeding kan leveren (alleen Raspberry Pi 5+). Hogere waarden bieden meer vermogen voor USB-randapparatuur. Bereik: 3000-5000mA. Standaard: 5000mA.",
  "POWER_OFF_ON_HALT": "Uitschakelen bij halt",
  "POWER_OFF_ON_HALT_DOC": "Wanneer ingeschakeld, zal de Raspberry Pi de stroom volledig uitschakelen bij het stoppen in plaats van naar een laag verbruik modus te gaan. Nuttig voor het verminderen van het standby stroomverbruik.",
  "WAKE_ON_GPIO": "Ontwaken via GPIO",
  "WAKE_ON_GPIO_DOC": "Sta de Raspberry Pi toe om te ontwaken uit de halt status met GPIO-signalen. Aanbevolen om ingeschakeld te houden voor de meeste gebruikssituaties.",
  "PCIE_PROBE": "PCIe Apparaatdetectie",
  "PCIE_PROBE_DOC": "Schakelt PCIe-apparaatdetectie tijdens het opstarten in. Vereist voor NVMe-opstartondersteuning. Alleen uitschakelen bij opstartproblemen met PCIe-apparaten.",
  "BOOT_UART": "Seriële Console (UART)",
  "BOOT_UART_DOC": "Schakelt UART seriële console in op GPIO-pinnen 14 en 15. Nuttig voor het debuggen van opstartproblemen. Uitgeschakeld houden voor normale werking.",
  "UART_BAUD": "UART Baudrate",
  "UART_BAUD_DOC": "Communicatiesnelheid voor UART seriële console (alleen Raspberry Pi 5+). Alleen van toepassing wanneer UART is ingeschakeld. Standaard: 115200.",
  "ADVANCED_SETTINGS": "Geavanceerde instellingen",
  "SHOW_ADVANCED_SETTINGS": "Geavanceerde instellingen tonen",
  "SHOW_ADVANCED_SETTINGS_DOC": "Inschakelen om geavanceerde USB- en opslagconfiguratieopties weer te geven. Alleen wijzigen als u de impact op het opstartgedrag begrijpt.",
  "CONFIRM_ADVANCED_SETTINGS": "Geavanceerde instellingen bevestigen",
  "USB_MSD_DISCOVER_TIMEOUT": "USB Detectie Timeout (ms)",
  "USB_MSD_DISCOVER_TIMEOUT_DOC": "Wachttijd voor het detecteren van USB-massaopslagapparaten tijdens het opstarten. Verhogen als USB-apparaten niet worden herkend. Bereik: 5000-60000ms. Standaard: 20000ms.",
  "USB_MSD_LUN_TIMEOUT": "USB LUN Timeout (ms)",
  "USB_MSD_LUN_TIMEOUT_DOC": "Wachttijd voor elk Logical Unit Number (LUN) op USB-massaopslagapparaten. Bereik: 100-10000ms. Standaard: 2000ms.",
  "USB_MSD_PWR_OFF_TIME": "USB Uitschakeltijd (ms)",
  "USB_MSD_PWR_OFF_TIME_DOC": "Vertraging voordat USB-poorten worden uitgeschakeld na een mislukte opstartpoging. Bereik: 0-5000ms. Standaard: 1000ms.",
  "USB_MSD_STARTUP_DELAY": "USB Opstartvertraging (ms)",
  "USB_MSD_STARTUP_DELAY_DOC": "Extra vertraging voordat wordt geprobeerd op te starten vanaf USB-apparaten. Nuttig voor trage USB-apparaten die extra tijd nodig hebben om te initialiseren. Bereik: 0-30000ms. Standaard: 0ms.",
  "USB_MSD_BOOT_MAX_RETRIES": "USB Opstart Max. Pogingen",
  "USB_MSD_BOOT_MAX_RETRIES_DOC": "Aantal keren om opnieuw te proberen op te starten vanaf USB-apparaten na een fout. Bereik: 0-9. Standaard: 1.",
  "SD_BOOT_MAX_RETRIES": "SD-kaart Opstart Max. Pogingen",
  "SD_BOOT_MAX_RETRIES_DOC": "Aantal keren om opnieuw te proberen op te starten vanaf de SD-kaart na een fout. Bereik: 0-9. Standaard: 3.",
  "ENABLE_SELF_UPDATE": "EEPROM Zelf-Update inschakelen",
  "ENABLE_SELF_UPDATE_DOC": "Sta de bootloader toe om zichzelf automatisch bij te werken tijdens het opstarten wanneer een nieuwere versie wordt gedetecteerd in /boot. Niet aanbevolen voor productiesystemen.",
  "FREEZE_VERSION": "EEPROM Versie bevriezen",
  "FREEZE_VERSION_DOC": "Voorkom alle EEPROM-updates, inclusief zelf-updates en handmatige updates. Inschakelen om de huidige bootloader-versie te vergrendelen.",
  "VL805": "VL805 Firmware Versie",
  "VL805_DOC": "USB 3.0 controller firmware versie (alleen Compute Module 4). Leeg laten voor automatische detectie. Formaat: hexadecimale waarde (bijv. 000138a1).",
  "PARTITION": "Opstart Partitienummer",
  "PARTITION_DOC": "Partitienummer om vanaf op te starten. 0 betekent automatisch detecteren van de eerste opstartbare partitie. Bereik: 0-255. Standaard: 0.",
  "DEBUG_SETTINGS": "Debug instellingen",
  "SHOW_DEBUG_SETTINGS": "Debug instellingen tonen",
  "SHOW_DEBUG_SETTINGS_DOC": "Inschakelen om debugging- en diagnostische opties weer te geven. Deze instellingen zijn alleen voor geavanceerde probleemoplossing.",
  "CONFIRM_DEBUG_SETTINGS": "Debug instellingen bevestigen",
  "DISABLE_HDMI": "HDMI Diagnostiek uitschakelen",
  "DISABLE_HDMI_DOC": "Schakelt HDMI-uitvoer uit tijdens vroege opstart diagnostiek. Inschakelen om HDMI-weergave tijdens de opstartsequentie te voorkomen.",
  "HDMI_DELAY": "HDMI Vertraging (seconden)",
  "HDMI_DELAY_DOC": "Vertraging voordat HDMI-uitvoer wordt geinitialiseerd tijdens het opstarten. Nuttig voor displays die extra tijd nodig hebben om te ontwaken. Bereik: 0-10 seconden. Standaard: 5 seconden.",
  "NETCONSOLE": "Netwerk Console",
  "NETCONSOLE_DOC": "Netwerk console configuratie voor geavanceerd debuggen. Formaat: doel_ip,poort,gateway_ip (bijv. 192.168.1.100,6666,192.168.1.1). Leeg laten om uit te schakelen. Max 32 tekens.",
  "DHCP_TIMEOUT": "DHCP Timeout (ms)",
  "DHCP_TIMEOUT_DOC": "Timeout voor DHCP-verzoeken tijdens netwerk opstart. Alleen relevant bij gebruik van netwerk opstart. Bereik: 5000-90000ms. Standaard: 45000ms.",
  "BACKUP_RESTORE": "Back-up & Herstel",
  "SHOW_RESTORE_OPTIONS": "Herstelopties tonen",
  "SHOW_RESTORE_OPTIONS_DOC": "Inschakelen om back-upherstel en fabrieksreset opties weer te geven. Gebruik deze om te herstellen van configuratieproblemen.",
  "RESTORE_FROM_BACKUP": "Herstellen vanuit back-up",
  "RESTORE_FROM_BACKUP_DOC": "EEPROM-configuratie herstellen vanuit de laatste back-up die is gemaakt voordat wijzigingen werden opgeslagen. Systeem wordt opnieuw opgestart na herstel.",
  "RESTORE_FACTORY_DEFAULTS": "Fabrieksinstellingen herstellen",
  "RESTORE_FACTORY_DEFAULTS_DOC": "EEPROM-configuratie resetten naar Raspberry Pi fabrieksinstellingen voor uw hardwaremodel. Dit herstelt veilige opstart instellingen. Systeem wordt opnieuw opgestart na herstel.",
  "APPLY_CONFIGURATION": "Configuratie toepassen",
  "APPLY_AND_REBOOT": "Configuratie toepassen & Herstarten",
  "RISK_ACKNOWLEDGED": "Ik begrijp de risico's en wil de wijzigingen toepassen",
  "RISK_ACKNOWLEDGED_DOC": "WAARSCHUWING: Het wijzigen van EEPROM-instellingen kan voorkomen dat uw Raspberry Pi opstart. Zorg ervoor dat u alle hierboven voorbereide instellingen hebt beoordeeld en een back-up SD-kaart of herstelmethode beschikbaar heeft. Wijzigingen vereisen een herstart om effect te hebben.",
  "SAVE_CONFIGURATION": "Configuratie opslaan en herstarten"
}
