{
  "PLUGIN_NAME": "Actualizador de firmware EEPROM de Raspberry Pi",
  "CURRENT_VERSION": "Versión actual del gestor de arranque",
  "CURRENT_DATE": "Fecha de instalación",
  "CURRENT_HASH": "Hash de versión",
  "FIRMWARE_CHANNEL": "Canal de lanzamiento de firmware",
  "SELECT_CHANNEL": "Seleccionar canal de lanzamiento",
  "CHANNEL_DESCRIPTION": "El canal predeterminado contiene versiones estables. El canal latest contiene nuevas características y correcciones de errores.",
  "AVAILABLE_VERSION": "Versión disponible en el canal seleccionado",
  "UPGRADE_FIRMWARE": "Actualización de firmware",
  "DOWNGRADE_FIRMWARE": "Degradación de firmware",
  "UPDATE_NOW": "Actualizar ahora",
  "DOWNGRADE_CONFIRM": "Comprendo los riesgos de degradar el firmware",
  "DOWNGRADE_NOW": "Degradar firmware",
  "STATUS": "Estado",
  "SAVE": "Guardar canal",
  "DOWNGRADE_INFO_TITLE": "Información adicional",
  "DOWNGRADE_INFO_TEXT": "Para la gestión manual del firmware o procedimientos avanzados de degradación, consulte la documentación oficial de Raspberry Pi en: https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#raspberry-pi-4-boot-eeprom",
  "UNSUPPORTED_HARDWARE": "Hardware no compatible",
  "UNSUPPORTED_HARDWARE_MESSAGE": "Este modelo de Raspberry Pi no admite actualizaciones del gestor de arranque EEPROM a través de este plugin. Las actualizaciones de firmware EEPROM solo están disponibles para Raspberry Pi 4, 400, 5, 500, 500+ y Compute Modules 4 y 5. Su dispositivo utiliza un método de arranque diferente o tiene el firmware almacenado en tarjeta SD/eMMC en lugar de en una EEPROM actualizable. No se requiere ninguna acción.",
  "PACKAGE_MANAGEMENT": "Gestión de base de datos de paquetes",
  "PACKAGE_MANAGEMENT_DESC": "El paquete rpi-eeprom contiene la base de datos de versiones de firmware. Si instaló este complemento hace algún tiempo, es posible que haya versiones de firmware más nuevas disponibles después de actualizar el paquete. Haga clic en el botón a continuación para buscar actualizaciones de paquetes.",
  "CHECK_PACKAGE_UPDATES": "Buscar actualizaciones de paquetes"
}
