{
  "PLUGIN_NAME": "Mise à jour du micrologiciel EEPROM Raspberry Pi",
  "CURRENT_VERSION": "Version actuelle du chargeur d'amorçage",
  "CURRENT_DATE": "Date d'installation",
  "CURRENT_HASH": "Hash de version",
  "FIRMWARE_CHANNEL": "Canal de publication du micrologiciel",
  "SELECT_CHANNEL": "Sélectionner le canal de publication",
  "CHANNEL_DESCRIPTION": "Le canal par défaut contient des versions stables. Le canal latest contient de nouvelles fonctionnalités et corrections de bugs.",
  "AVAILABLE_VERSION": "Version disponible dans le canal sélectionné",
  "UPGRADE_FIRMWARE": "Mise à niveau du micrologiciel",
  "DOWNGRADE_FIRMWARE": "Rétrogradation du micrologiciel",
  "UPDATE_NOW": "Mettre à jour maintenant",
  "DOWNGRADE_CONFIRM": "Je comprends les risques de rétrograder le micrologiciel",
  "DOWNGRADE_NOW": "Rétrograder le micrologiciel",
  "STATUS": "Statut",
  "SAVE": "Enregistrer le canal",
  "DOWNGRADE_INFO_TITLE": "Informations supplémentaires",
  "DOWNGRADE_INFO_TEXT": "Pour la gestion manuelle du micrologiciel ou les procédures de rétrogradation avancées, veuillez consulter la documentation officielle Raspberry Pi à l'adresse: https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#raspberry-pi-4-boot-eeprom",
  "UNSUPPORTED_HARDWARE": "Matériel non pris en charge",
  "UNSUPPORTED_HARDWARE_MESSAGE": "Ce modèle de Raspberry Pi ne prend pas en charge les mises à jour du micrologiciel EEPROM via ce plugin. Les mises à jour du micrologiciel EEPROM sont uniquement disponibles pour les Raspberry Pi 4, 400, 5, 500, 500+ et les Compute Modules 4 et 5. Votre appareil utilise soit une méthode de démarrage différente, soit un micrologiciel stocké sur carte SD/eMMC plutôt que dans une EEPROM modifiable. Aucune action n'est requise.",
  "PACKAGE_MANAGEMENT": "Gestion de la base de données des paquets",
  "PACKAGE_MANAGEMENT_DESC": "Le paquet rpi-eeprom contient la base de données des versions du micrologiciel. Si vous avez installé ce plugin il y a quelque temps, de nouvelles versions du micrologiciel peuvent être disponibles après la mise à jour du paquet. Cliquez sur le bouton ci-dessous pour vérifier les mises à jour du paquet.",
  "CHECK_PACKAGE_UPDATES": "Vérifier les mises à jour du paquet"
}
