{
  "PLUGIN_CONFIGURATION": "Configuration du Plugin AutoStart",
  "HEADING": "Activez ce plugin pour lire de la musique au demarrage de Volumio",
  "SAVE": "Enregistrer",

  "AUTOSTART_SETTINGS": "Parametres de Lecture",
  "AUTOSTART_SETTINGS_DESC": "Configurez la lecture automatique au demarrage de Volumio.",
  "AUTOSTART_SAVEFROMLASTPOS_DOC": "Lire depuis la derniere position dans la file d'attente avant l'arret de Volumio. Sinon, la lecture commence depuis le debut de la file d'attente.",
  "AUTOSTART_SAVEFROMLASTPOS": "Lire Depuis la Derniere Position",
  "AUTOSTART_DELAY_DOC": "Delai supplementaire apres que le systeme soit pret et le volume regle. Augmentez si votre materiel audio necessite plus de temps pour s'initialiser.",
  "AUTOSTART_DELAY": "Delai Supplementaire (millisecondes)",

  "VOLUME_INFO": "Informations sur le Volume au Demarrage",
  "VOLUME_INFO_DESC1": "Le volume au demarrage peut etre configure a plusieurs endroits: Options de Lecture Volumio, plugins materiel ou DAC, et ce plugin. Chacun s'applique a un moment different pendant la sequence de demarrage. Lorsque plusieurs parametres sont actives, ceux appliques plus tard remplaceront les precedents - cela peut provoquer des conflits ou des niveaux de volume inattendus. Verifiez vos parametres a chaque emplacement pour assurer un comportement coherent.",
  "VOLUME_INFO2": "Chronologie du Volume AutoStart",
  "VOLUME_INFO_DESC2": "AutoStart applique son reglage de volume apres que le systeme soit completement pret, immediatement avant le debut de la lecture. Cela en fait le dernier dans la sequence de demarrage, remplacant tous les reglages de volume precedents.",

  "VOLUME_SETTINGS": "Volume au Demarrage",
  "VOLUME_SETTINGS_DESC": "Definir un niveau de volume specifique immediatement avant le debut de la lecture.",
  "VOLUME_ENABLED": "Activer le Volume au Demarrage",
  "VOLUME_ENABLED_DOC": "Lorsqu'active, le volume sera regle au niveau specifie apres que le systeme soit completement pret, avant le debut de la lecture.",
  "VOLUME_LEVEL": "Niveau de Volume (0-100)",
  "VOLUME_LEVEL_DOC": "Niveau de volume a definir au demarrage. La valeur doit etre entre 0 et 100. Note: Cela peut ne pas fonctionner si le mixeur est regle sur Aucun.",

  "POLLING_SETTINGS": "Avance: Detection Systeme Pret",
  "POLLING_SETTINGS_DESC": "Controle comment le plugin attend que Volumio soit completement initialise avant de commencer la lecture. Le materiel plus lent comme Raspberry Pi Zero peut necessiter des delais plus longs.",
  "SHOW_POLLING_SETTINGS": "Afficher les Parametres Avances",
  "SHOW_POLLING_SETTINGS_DOC": "Basculer pour reveler la configuration des delais. Le temps d'attente par defaut est de 5 minutes (5000ms x 60 tentatives).",
  "POLLING_INTERVAL": "Intervalle de Verification (millisecondes)",
  "POLLING_INTERVAL_DOC": "Frequence de verification si le systeme est pret. Par defaut: 5000ms (5 secondes).",
  "MAX_POLLING_ATTEMPTS": "Tentatives de Verification Maximum",
  "MAX_POLLING_ATTEMPTS_DOC": "Nombre maximum de verifications avant expiration. Par defaut: 60 tentatives."
}
