{
  "PLUGIN_CONFIGURATION": "Configuracion del Plugin AutoStart",
  "HEADING": "Habilite este plugin para reproducir musica cuando Volumio se inicie",
  "SAVE": "Guardar",

  "AUTOSTART_SETTINGS": "Ajustes de Reproduccion",
  "AUTOSTART_SETTINGS_DESC": "Configure la reproduccion automatica cuando Volumio se inicie.",
  "AUTOSTART_SAVEFROMLASTPOS_DOC": "Reproducir desde la ultima posicion en la cola antes de que Volumio se apagara. De lo contrario, la reproduccion comienza desde el principio de la cola.",
  "AUTOSTART_SAVEFROMLASTPOS": "Reproducir Desde Ultima Posicion",
  "AUTOSTART_DELAY_DOC": "Retraso adicional despues de que el sistema este listo y el volumen configurado. Aumente si su hardware de audio necesita tiempo extra para inicializarse.",
  "AUTOSTART_DELAY": "Retraso Adicional (milisegundos)",

  "VOLUME_INFO": "Informacion del Volumen de Inicio",
  "VOLUME_INFO_DESC1": "El volumen de inicio se puede configurar en multiples ubicaciones: Opciones de Reproduccion de Volumio, plugins de hardware o DAC, y este plugin. Cada uno se aplica en un momento diferente durante la secuencia de arranque. Cuando hay multiples ajustes habilitados, los aplicados posteriormente anularan los anteriores - esto puede causar conflictos o niveles de volumen inesperados. Revise sus ajustes en cada ubicacion para asegurar un comportamiento consistente.",
  "VOLUME_INFO2": "Temporizacion del Volumen de AutoStart",
  "VOLUME_INFO_DESC2": "AutoStart aplica su ajuste de volumen despues de que el sistema este completamente listo, inmediatamente antes de que comience la reproduccion. Esto lo convierte en el ultimo en la secuencia de inicio, anulando cualquier ajuste de volumen anterior.",

  "VOLUME_SETTINGS": "Volumen de Inicio",
  "VOLUME_SETTINGS_DESC": "Establecer un nivel de volumen especifico inmediatamente antes de que comience la reproduccion.",
  "VOLUME_ENABLED": "Habilitar Volumen de Inicio",
  "VOLUME_ENABLED_DOC": "Cuando esta habilitado, el volumen se establecera al nivel especificado despues de que el sistema este completamente listo, antes de que comience la reproduccion.",
  "VOLUME_LEVEL": "Nivel de Volumen (0-100)",
  "VOLUME_LEVEL_DOC": "Nivel de volumen a establecer en el inicio. El valor debe estar entre 0 y 100. Nota: Esto puede no funcionar si el mezclador esta configurado en Ninguno.",

  "POLLING_SETTINGS": "Avanzado: Deteccion de Sistema Listo",
  "POLLING_SETTINGS_DESC": "Controla como el plugin espera a que Volumio se inicialice completamente antes de comenzar la reproduccion. Hardware mas lento como Raspberry Pi Zero puede necesitar tiempos de espera mas largos.",
  "SHOW_POLLING_SETTINGS": "Mostrar Ajustes Avanzados",
  "SHOW_POLLING_SETTINGS_DOC": "Alternar para revelar la configuracion de tiempos. El tiempo de espera predeterminado es 5 minutos (5000ms x 60 intentos).",
  "POLLING_INTERVAL": "Intervalo de Verificacion (milisegundos)",
  "POLLING_INTERVAL_DOC": "Con que frecuencia verificar si el sistema esta listo. Predeterminado: 5000ms (5 segundos).",
  "MAX_POLLING_ATTEMPTS": "Intentos Maximos de Verificacion",
  "MAX_POLLING_ATTEMPTS_DOC": "Numero maximo de verificaciones antes del tiempo de espera. Predeterminado: 60 intentos."
}
